mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xr/projects/iar/startup_mb9b160r.s
                PUBWEAK ADC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC1_IRQHandler
                B       ADC1_IRQHandler

                PUBWEAK DMAC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC0_IRQHandler
                B       DMAC0_IRQHandler

                PUBWEAK DMAC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC1_IRQHandler
                B       DMAC1_IRQHandler

                PUBWEAK DMAC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC2_IRQHandler
                B       DMAC2_IRQHandler

                PUBWEAK DMAC3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC3_IRQHandler
                B       DMAC3_IRQHandler

                PUBWEAK DMAC4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC4_IRQHandler
                B       DMAC4_IRQHandler

                PUBWEAK DMAC5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC5_IRQHandler
                B       DMAC5_IRQHandler

                PUBWEAK DMAC6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC6_IRQHandler
                B       DMAC6_IRQHandler

                PUBWEAK DMAC7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DMAC7_IRQHandler
                B       DMAC7_IRQHandler

                PUBWEAK DSTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_IRQHandler
                B       DSTC_IRQHandler

                PUBWEAK EXINT16_19_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT16_19_IRQHandler
                B       EXINT16_19_IRQHandler

                PUBWEAK EXINT20_23_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT20_23_IRQHandler
                B       EXINT20_23_IRQHandler

                PUBWEAK EXINT24_27_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT24_27_IRQHandler
                B       EXINT24_27_IRQHandler

                PUBWEAK EXINT28_31_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT28_31_IRQHandler
                B       EXINT28_31_IRQHandler

                PUBWEAK ADC2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
ADC2_IRQHandler
                B       ADC2_IRQHandler

                PUBWEAK DSTC_HW_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_HW_IRQHandler
                B       DSTC_HW_IRQHandler

                PUBWEAK SD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
SD_IRQHandler
                B       SD_IRQHandler

                PUBWEAK FLASHIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
FLASHIF_IRQHandler
                B       FLASHIF_IRQHandler




                PUBWEAK Dummy
                SECTION .text:CODE:REORDER:NOROOT(1)
Dummy
                B       Dummy

                END
